Repository: mostafaamer-22/todo-task
Catalog: Src/ToDo.Domain/Resources/Message.*.resx
Languages: ar

# Err_MapLink_must_not_exceed_500_characters
source: MapLink must not exceed 500 characters
ar: يجب ألا يتجاوز رابط الخريطة 500 حرف

# Application.BadRequest
source: The Request is bad
ar: الطلب سيء

# Application.Conflict
source: There was a conflict with the current state of the resource.
ar: حدث تعارض مع حالة المحتوى الحالية.

# Application.Forbidden
source: Access to this resource is forbidden.
ar: لوصول إلى هذا المحتوى محظور

# Application.InternalServerError
source: An unexpected error occurred. Please try again later.
ar: حدث خطأ غير متوقع. يرجى المحاولة لاحقًا.

# Application.NotFound
source: The requested resource was not found.
ar: لم يتم العثور على المحتوى المطلوب

# Application.ServiceUnavailable
source: The service is temporarily unavailable. Please try again later.
ar: الخدمة غير متوفرة مؤقتًا. يرجى المحاولة لاحقًا.

# Application.TooManyRequests
source: You have sent too many requests. Please wait and try again.
ar: لقد أرسلت عددًا كبيرًا جدًا من الطلبات. يرجى الانتظار والمحاولة مرة أخرى.

# Application.Unauthorized
source: The Request is not authorized
ar: الطلب غير مصرح به

# Application.UnprocessableEntity
source: The request could not be processed.
ar: تعذر معالجة الطلب

# Application.Validation
source: One or more validation errors occurred.
ar: حدث خطأ في التحقق من صحة البيانات.

# Authority.AuditNotFound
source: Audit not found.
ar: لم يتم العثور على التدقيق

# Authority.AuthorityMediaNotFound
source: Authority media not found.
ar: لم يتم العثور على وسائط الهيئة

# Authority.BranchNotFound
source: Branch not found.
ar: لم يتم العثور على الفرع

# Authority.DirectoryAlreadyExists
source: Directory already exists.
ar: دليل الهيئة موجود بالفعل

# Authority.DirectoryNotFound
source: Directory not found.
ar: لم يتم العثور على دليل الهيئة

# Authority.HistoryAlreadyExists
source: History already exists.
ar: تاريخ الهيئة موجود بالفعل

# Authority.HistoryNotFound
source: History not found.
ar: لم يتم العثور على تاريخ الهيئة

# Authority.InvalidAuditSnapshot
source: Invalid audit snapshot.
ar: لقطة التدقيق غير صالحة

# Authority.MediaNotFound
source: Media not found.
ar: لم يتم العثور على الوسائط

# Authority.NotFound
source: Authority not found or you don't have permission to view it.
ar: لم يتم العثور على الهيئة أو ليس لديك إذن لعرضها.

# Authority.PresidentAlreadyExists
source: President already exists.
ar: رئيس الهيئة موجود بالفعل

# Authority.PresidentNotFound
source: President not found
ar: لم يتم العثور على رئيس الهيئة

# Authority.SocialMediaLinkNotFound
source: Social media link not found.
ar: لم يتم العثور على رابط وسائل التواصل الاجتماعي.

# Er_Url_must_be_ avalid_URI
source: Url must be a valid URI
ar: يجب أن يكون عنوان لينك عبارة عن عنوان لينك صالح

# Err_AddressAr_must_not_exceed_500_characters
source: AddressAr must not exceed 500 characters
ar: يجب ألا يتجاوز العنوان بالعربي 500 حرف

# Err_AddressEn_must_not_exceed_500_characters
source: Platform must not exceed 100 characters
ar: يجب ألا يتجاوز العنوان بالانجليزية 500 حرف

# ERR_ATLEASTONEDESCRIPTION_REQUIRED
source: At Least One Description Required
ar: مطلوب وصف واحد على الأقل

# ERR_ATLEASTONETITLE_REQUIRED
source: At Least One Description Required
ar: مطلوب وصف واحد على الأقل

# Err_Branches_must_not_be_empty.
source: Branches must not be empty.
ar: لا يجب أن تكون الفروع فارغة.

# Err_Contacts_must_not_be_null
source: Contacts must not be null
ar: يجب ألا تكون جهات الاتصال فارغة

# ERR_DESCRIPTION_ARABIC_REQUIRED
source: The description must contain Arabic content .
ar: يجب أن يحتوي الوصف على محتوى باللغة العربية

# ERR_DESCRIPTION_ENGLISH_REQUIRED
source: The description must contain English content if Arabic content is not provided
ar: يجب أن يحتوي الوصف على محتوى باللغة الإنجليزية إذا لم يتم توفير محتوى باللغة العربية

# Err_DescriptionAr_must_not_exceed_1000_characters
source: DescriptionEn must not exceed 1000 characters
ar: الوصف يجب ألا يتجاوز النص العربي 1000 حرف

# Err_DescriptionEn_must_not_exceed_1000_characters
source: DescriptionEn must not exceed 1000 characters
ar: الوصف يجب ألا يتجاوز النص الإنجليزي 1000 حرف

# Err_Email_is_required
source: Email is required
ar: البريد الإلكتروني مطلوب

# Err_Email_must_be_avalid_email_address
source: MapLink must not exceed 500 characters
ar: يجب أن يكون البريد الإلكتروني عنوان بريد إلكتروني صالحًا

# Err_Error_Server
source: Error Server
ar: خطأ في الخادم

# ERR_LANGUAGE_CONSISTENCY
source: The Title and Description must be in the same language (both Arabic or both English).
ar: يجب أن يكون العنوان والوصف باللغة نفسها (إما العربية أو الإنجليزية).

# Err_MapLink_is_required
source: MapLink is required
ar: مطلوب رابط الخريطة

# Application.Success
source: Success
ar: نجاح

# ErrTitleNull
source: title Must not be null
ar: العنوان لا يجب أن يكون فارغا

# ErrDescriptionNull
source: Description Must not be null
ar: الوصف لا يجب أن يكون فارغا
